const course = [
	{
		id: 7,
		title: "Хімія 7 клас",
		info: "Це старт. Тут ми освоїмо базові навички курсу з хімії.",
		themes: [
			{
				id: 70,
				title: "Вступ хімії",
				info: `Слово «хімія» у світі часто викликає негативну реакцію. 
				В уяві постають отруєні водоймища, кислотні дощі, шкідливі хімічні добавки до їжі тощо. 
				Але хімія оточує нас всюди. Немає жодної сфери, де б не використовувалися продукти хімічної 
				та нафтохімічної промисловості. Шкільний зошит, книга, ручка, дошка, меблі, одяг, будинки, 
				машини та багато іншого виготовлені завдяки знанням хімії. Хімія - цікава та складна наука. 
				Для оволодіння нею необхідно не тільки засвоїти матеріал, що вивчається, але і 
				навчитися застосовувати отримані знання в повсякденному житті.
				
				Для кожної людини важливе знання основ хімічної науки та розуміння хімічних
				процесів для пояснення природних явищ, правильного використання хімічних
				знань з метою покращення свого побуту, збереження здоров'я та навколишнього середовища.
				Знання з хімії потрібні у розвиток хімічного виробництва, поліпшення якості життя людей.`,
				downInfo: `Для кожної людини важливе знання основ хімічної науки та розуміння 
				хімічних процесів для пояснення природних явищ, правильного використання хімічних знань 
				з метою покращення свого побуту, збереження здоров'я та навколишнього середовища.
				Знання з хімії потрібні у розвиток хімічного виробництва, поліпшення якості життя людей.
				Грамотне використання хімічних знань дозволяє людству вирішувати найважливіші проблеми сучасності 
				– продовольчу, енергетичну, екологічну.
				
				Так, продуктивність сільськогосподарського виробництва багато в чому залежить від того, як хімічна 
				промисловість забезпечує його мінеральними добривами та засобами захисту рослин від шкідників. 
				Велика роль хімії у виробництві будівельних матеріалів, синтетичних тканин, пластмас, фарб, 
				миючих засобів, медикаментів. Хімія забезпечує переробку корисних копалин 
				на цінні продукти: метали та його сплави, паливо.`,
				url: "",
				video: "https://www.youtube.com/embed/7OU_HCiqBgw",
				answers: [
					{
						id: 0,
						type: "test",
						question: "Хімія вивчає ...",
						terms: "виберіть 1 правильну відповідь",
						answer: [
							{
								id: 1,
								answer: "...хімію",
							},
							{
								id: 0,
								answer: "...біологію",
							},
							{
								id: 0,
								answer: "...фізику",
							},
							{
								id: 0,
								answer: "...алгебру",
							}
						]
					},
					{
						id: 1,
						type: "test",
						question: "Від чого залежить продуктивність сільськогосподарського виробництва",
						terms: "виберіть 1 правильну відповідь",
						answer: [
							{
								id: 1,
								answer: "від хімії",
							},
							{
								id: 0,
								answer: "від села",
							},
							{
								id: 0,
								answer: "від фермера",
							},
							{
								id: 0,
								answer: "від президента",
							}
						]
					},
				]
			},
			{
				id: 71,
				title: "Що вивчає хімія?",
				info: `Вивчаючи природознавство, фізику, біологію, ви вже 
				познайомилися з поняттями «фізичне тіло» і «речовина», маєте 
				уявлення про склад фізичних тіл. Наприклад, шматок граніту 
				та зерно – це фізичні тіла. Вони неоднорідні.
				До складу зерна входять крохмаль, білки, рослинні жири. Граніт 
				складається з кварцу, слюди та польового шпату. Білки, рослинні 
				жири, кварц, слюда, польовий шпат, крохмаль – це речовини.

				Речовини це те, з чого складаються фізичні тіла.
				Речов дуже багато, і кожне їх характеризуються певними властивостями.
				Ознаки, якими речовини відрізняються одна від друга чи подібні між собою, називаються властивостями речовин.
				Важливим завданням хімії є вивчення речовин, їх властивостей та прогнозування використання речовин у народному господарстві.`,
				downInfo: ``,
				url: "",
				video: "https://www.youtube.com/embed/EpBWOBo7-UU",
				answers: [
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
						}
					},
					{
						id: 0,
						type: "test",
						question: "Химия изучает ...",
						terms: "выберите 1 правильный ответ",
						answer: [
							{
								id: 1,
								answer: "...химию",
							},
							{
								id: 0,
								answer: "...биологию",
							},
							{
								id: 0,
								answer: "...физику",
							},
							{
								id: 0,
								answer: "...алгебру",
							},
							{
								id: 0,
								answer: "...биологию",
							},
							{
								id: 0,
								answer: "...физику",
							},
							{
								id: 0,
								answer: "...алгебру",
							}
						]
					},
					{
						id: 0,
						type: "test",
						question: "Химия изучает ...",
						terms: "выберите 1 правильный ответ",
						answer: [
							{
								id: 1,
								answer: "...химию",
							},
							{
								id: 0,
								answer: "...биологию",
							},
						]
					},
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
							{
								type: "weight",
								what: "соли",
							}
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O + С",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
							с: 4,
						}
					},
				]
			},
			{
				id: 72,
				title: "Вступ хімії",
				info: `Атоми — найдрібніші хімічно неподільні частки, у тому числі складаються речовини.
				На сьогоднішній день відомо 118 видів атомів. Понад 90 їх існують у природі, інші ж отримані штучно.
				<br>
				Атоми характеризуються:
				-певними дуже малими розмірами;
				-певною, також дуже малою, масою;
				-певною будовою.
				Розміри атомів настільки малі, що побачити їх неможливо навіть у 
				найпотужніший мікроскоп. Радіуси атомів становлять 0,046-0,25 нм (1 нм = 10-9 м). 
				Найменший – атом гелію, а найбільший – Франція.`,
				downInfo: `Маси атомів теж дуже малі. Так маса атома водню становить лише 1,67⋅10−24 г.
 
				До кінця 19 століття атоми вважали неподільними частинками. Але вчені довели, що атом має складну будову.
				 
				Згідно з сучасними уявленнями кожен атом складається з позитивно зарядженого ядра і електронів, що рухаються навколо нього. Електрони мають негативний заряд та нейтралізують позитивний заряд ядра.
				 
				Ядро набагато менше від атома. Так, радіус атома водню становить 0,046 нм, а радіус його ядра - лише 0,00000065 нм. До його складу входять ще дрібніші частинки: протони (p) і нейтрони (n). Протони заряджені позитивно та визначають заряд ядра. Нейтрони – частки без заряду.
				 
				Заряд протона дорівнює за величиною заряду електрона, а число протонів в ядрі дорівнює кількості електронів в атомі. Тому атоми є нейтральними.
				 
				Атоми розрізняються між собою будовою (числом частинок, що в них містяться), а також масою і розмірами.`,
				url: "",
				video: "https://www.youtube.com/embed/7OU_HCiqBgw",
				answers: [
					{
						id: 0,
						type: "test",
						question: "Що таке атоми — ",
						terms: "виберіть 1 правильну відповідь",
						answer: [
							{
								id: 1,
								answer: "найдрібніші хімічно неподільні частки, у тому числі складаються речовини.",
							},
							{
								id: 0,
								answer: "сусід по парті",
							}
						]
					},
					{
						id: 1,
						type: "test",
						question: "Від чого залежить продуктивність сільськогосподарського виробництва",
						terms: "виберіть 1 правильну відповідь",
						answer: [
							{
								id: 1,
								answer: "від хімії",
							},
							{
								id: 0,
								answer: "від села",
							},
							{
								id: 0,
								answer: "від фермера",
							},
							{
								id: 0,
								answer: "від президента",
							},
							{
								id: 0,
								answer: "від села",
							},
							{
								id: 0,
								answer: "від фермера",
							},
							{
								id: 0,
								answer: "від президента",
							},
							{
								id: 0,
								answer: "від села",
							},
							{
								id: 0,
								answer: "від фермера",
							},
							{
								id: 0,
								answer: "від президента",
							}
						]
					},
				]
			},
		]
	},
	{
		id: 8,
		title: "Хімія 8 клас",
		info: "Це старт. Тут ми освоїмо базові навички курсу з хімії.",
		themes: [
			{
				id: 70,
				title: "Вступ хімії",
				info: `Слово «хімія» у світі часто викликає негативну реакцію. 
				В уяві постають отруєні водоймища, кислотні дощі, шкідливі хімічні добавки до їжі тощо. 
				Але хімія оточує нас всюди. Немає жодної сфери, де б не використовувалися продукти хімічної 
				та нафтохімічної промисловості. Шкільний зошит, книга, ручка, дошка, меблі, одяг, будинки, 
				машини та багато іншого виготовлені завдяки знанням хімії. Хімія - цікава та складна наука. 
				Для оволодіння нею необхідно не тільки засвоїти матеріал, що вивчається, але і 
				навчитися застосовувати отримані знання в повсякденному житті.
				
				Для кожної людини важливе знання основ хімічної науки та розуміння хімічних
				процесів для пояснення природних явищ, правильного використання хімічних
				знань з метою покращення свого побуту, збереження здоров'я та навколишнього середовища.
				Знання з хімії потрібні у розвиток хімічного виробництва, поліпшення якості життя людей.`,
				downInfo: `Для кожної людини важливе знання основ хімічної науки та розуміння 
				хімічних процесів для пояснення природних явищ, правильного використання хімічних знань 
				з метою покращення свого побуту, збереження здоров'я та навколишнього середовища.
				Знання з хімії потрібні у розвиток хімічного виробництва, поліпшення якості життя людей.
				Грамотне використання хімічних знань дозволяє людству вирішувати найважливіші проблеми сучасності 
				– продовольчу, енергетичну, екологічну.
				
				Так, продуктивність сільськогосподарського виробництва багато в чому залежить від того, як хімічна 
				промисловість забезпечує його мінеральними добривами та засобами захисту рослин від шкідників. 
				Велика роль хімії у виробництві будівельних матеріалів, синтетичних тканин, пластмас, фарб, 
				миючих засобів, медикаментів. Хімія забезпечує переробку корисних копалин 
				на цінні продукти: метали та його сплави, паливо.`,
				url: "",
				video: "https://www.youtube.com/embed/7OU_HCiqBgw",
				answers: [
					{
						id: 0,
						type: "test",
						question: "Хімія вивчає ...",
						terms: "виберіть 1 правильну відповідь",
						answer: [
							{
								id: 1,
								answer: "...хімію",
							},
							{
								id: 0,
								answer: "...біологію",
							},
							{
								id: 0,
								answer: "...фізику",
							},
							{
								id: 0,
								answer: "...алгебру",
							}
						]
					},
					{
						id: 1,
						type: "test",
						question: "Від чого залежить продуктивність сільськогосподарського виробництва",
						terms: "виберіть 1 правильну відповідь",
						answer: [
							{
								id: 1,
								answer: "від хімії",
							},
							{
								id: 0,
								answer: "від села",
							},
							{
								id: 0,
								answer: "від фермера",
							},
							{
								id: 0,
								answer: "від президента",
							}
						]
					},
				]
			},
			{
				id: 71,
				title: "Що вивчає хімія?",
				info: `Вивчаючи природознавство, фізику, біологію, ви вже 
				познайомилися з поняттями «фізичне тіло» і «речовина», маєте 
				уявлення про склад фізичних тіл. Наприклад, шматок граніту 
				та зерно – це фізичні тіла. Вони неоднорідні.
				До складу зерна входять крохмаль, білки, рослинні жири. Граніт 
				складається з кварцу, слюди та польового шпату. Білки, рослинні 
				жири, кварц, слюда, польовий шпат, крохмаль – це речовини.

				Речовини це те, з чого складаються фізичні тіла.
				Речов дуже багато, і кожне їх характеризуються певними властивостями.
				Ознаки, якими речовини відрізняються одна від друга чи подібні між собою, називаються властивостями речовин.
				Важливим завданням хімії є вивчення речовин, їх властивостей та прогнозування використання речовин у народному господарстві.`,
				downInfo: ``,
				url: "",
				video: "https://www.youtube.com/embed/EpBWOBo7-UU",
				answers: [
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
						}
					},
					{
						id: 0,
						type: "test",
						question: "Химия изучает ...",
						terms: "выберите 1 правильный ответ",
						answer: [
							{
								id: 1,
								answer: "...химию",
							},
							{
								id: 0,
								answer: "...биологию",
							},
							{
								id: 0,
								answer: "...физику",
							},
							{
								id: 0,
								answer: "...алгебру",
							}
						]
					},
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
							{
								type: "weight",
								what: "соли",
							}
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
						}
					},
				]
			},
			{
				id: 72,
				title: "3 занятие химии",
				info: "22222222222222222222Какая-то краткая информация, Какая-то краткая информация,222222222222222222222222Какая-то краткая информация, Какая-то краткая информация,22222222222222222222222222",
				downInfo: ``,
				url: "",
				video: "https://www.youtube.com/embed/GJN7hE5ijnI",
				answers: [
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
							{
								type: "weight",
								what: "соли",
							}
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
				]
			},
			{
				id: 71,
				title: "Що вивчає хімія?",
				info: `Вивчаючи природознавство, фізику, біологію, ви вже 
				познайомилися з поняттями «фізичне тіло» і «речовина», маєте 
				уявлення про склад фізичних тіл. Наприклад, шматок граніту 
				та зерно – це фізичні тіла. Вони неоднорідні.
				До складу зерна входять крохмаль, білки, рослинні жири. Граніт 
				складається з кварцу, слюди та польового шпату. Білки, рослинні 
				жири, кварц, слюда, польовий шпат, крохмаль – це речовини.

				Речовини це те, з чого складаються фізичні тіла.
				Речов дуже багато, і кожне їх характеризуються певними властивостями.
				Ознаки, якими речовини відрізняються одна від друга чи подібні між собою, називаються властивостями речовин.
				Важливим завданням хімії є вивчення речовин, їх властивостей та прогнозування використання речовин у народному господарстві.`,
				downInfo: ``,
				url: "",
				video: "https://www.youtube.com/embed/EpBWOBo7-UU",
				answers: [
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
						}
					},
					{
						id: 0,
						type: "test",
						question: "Химия изучает ...",
						terms: "выберите 1 правильный ответ",
						answer: [
							{
								id: 1,
								answer: "...химию",
							},
							{
								id: 0,
								answer: "...биологию",
							},
							{
								id: 0,
								answer: "...физику",
							},
							{
								id: 0,
								answer: "...алгебру",
							}
						]
					},
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
							{
								type: "weight",
								what: "соли",
							}
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
						}
					},
				]
			},
			{
				id: 72,
				title: "3 занятие химии",
				info: "22222222222222222222Какая-то краткая информация, Какая-то краткая информация,222222222222222222222222Какая-то краткая информация, Какая-то краткая информация,22222222222222222222222222",
				downInfo: ``,
				url: "",
				video: "https://www.youtube.com/embed/GJN7hE5ijnI",
				answers: [
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
							{
								type: "weight",
								what: "соли",
							}
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
				]
			},
			{
				id: 71,
				title: "Що вивчає хімія?",
				info: `Вивчаючи природознавство, фізику, біологію, ви вже 
				познайомилися з поняттями «фізичне тіло» і «речовина», маєте 
				уявлення про склад фізичних тіл. Наприклад, шматок граніту 
				та зерно – це фізичні тіла. Вони неоднорідні.
				До складу зерна входять крохмаль, білки, рослинні жири. Граніт 
				складається з кварцу, слюди та польового шпату. Білки, рослинні 
				жири, кварц, слюда, польовий шпат, крохмаль – це речовини.

				Речовини це те, з чого складаються фізичні тіла.
				Речов дуже багато, і кожне їх характеризуються певними властивостями.
				Ознаки, якими речовини відрізняються одна від друга чи подібні між собою, називаються властивостями речовин.
				Важливим завданням хімії є вивчення речовин, їх властивостей та прогнозування використання речовин у народному господарстві.`,
				downInfo: ``,
				url: "",
				video: "https://www.youtube.com/embed/EpBWOBo7-UU",
				answers: [
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
						}
					},
					{
						id: 0,
						type: "test",
						question: "Химия изучает ...",
						terms: "выберите 1 правильный ответ",
						answer: [
							{
								id: 1,
								answer: "...химию",
							},
							{
								id: 0,
								answer: "...биологию",
							},
							{
								id: 0,
								answer: "...физику",
							},
							{
								id: 0,
								answer: "...алгебру",
							}
						]
					},
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
							{
								type: "weight",
								what: "соли",
							}
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
						}
					},
				]
			},
			{
				id: 72,
				title: "3 занятие химии",
				info: "22222222222222222222Какая-то краткая информация, Какая-то краткая информация,222222222222222222222222Какая-то краткая информация, Какая-то краткая информация,22222222222222222222222222",
				downInfo: ``,
				url: "",
				video: "https://www.youtube.com/embed/GJN7hE5ijnI",
				answers: [
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
							{
								type: "weight",
								what: "соли",
							}
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
				]
			}
		]
	},
	{
		id: 9,
		title: "Хімія 9 клас",
		info: "Це старт. Тут ми освоїмо базові навички курсу з хімії.",
		themes: [
			{
				id: 70,
				title: "Вступ хімії",
				info: `Слово «хімія» у світі часто викликає негативну реакцію. 
				В уяві постають отруєні водоймища, кислотні дощі, шкідливі хімічні добавки до їжі тощо. 
				Але хімія оточує нас всюди. Немає жодної сфери, де б не використовувалися продукти хімічної 
				та нафтохімічної промисловості. Шкільний зошит, книга, ручка, дошка, меблі, одяг, будинки, 
				машини та багато іншого виготовлені завдяки знанням хімії. Хімія - цікава та складна наука. 
				Для оволодіння нею необхідно не тільки засвоїти матеріал, що вивчається, але і 
				навчитися застосовувати отримані знання в повсякденному житті.
				
				Для кожної людини важливе знання основ хімічної науки та розуміння хімічних
				процесів для пояснення природних явищ, правильного використання хімічних
				знань з метою покращення свого побуту, збереження здоров'я та навколишнього середовища.
				Знання з хімії потрібні у розвиток хімічного виробництва, поліпшення якості життя людей.`,
				downInfo: `Для кожної людини важливе знання основ хімічної науки та розуміння 
				хімічних процесів для пояснення природних явищ, правильного використання хімічних знань 
				з метою покращення свого побуту, збереження здоров'я та навколишнього середовища.
				Знання з хімії потрібні у розвиток хімічного виробництва, поліпшення якості життя людей.
				Грамотне використання хімічних знань дозволяє людству вирішувати найважливіші проблеми сучасності 
				– продовольчу, енергетичну, екологічну.
				
				Так, продуктивність сільськогосподарського виробництва багато в чому залежить від того, як хімічна 
				промисловість забезпечує його мінеральними добривами та засобами захисту рослин від шкідників. 
				Велика роль хімії у виробництві будівельних матеріалів, синтетичних тканин, пластмас, фарб, 
				миючих засобів, медикаментів. Хімія забезпечує переробку корисних копалин 
				на цінні продукти: метали та його сплави, паливо.`,
				url: "",
				video: "https://www.youtube.com/embed/7OU_HCiqBgw",
				answers: [
					{
						id: 0,
						type: "test",
						question: "Хімія вивчає ...",
						terms: "виберіть 1 правильну відповідь",
						answer: [
							{
								id: 1,
								answer: "...хімію",
							},
							{
								id: 0,
								answer: "...біологію",
							},
							{
								id: 0,
								answer: "...фізику",
							},
							{
								id: 0,
								answer: "...алгебру",
							}
						]
					},
					{
						id: 1,
						type: "test",
						question: "Від чого залежить продуктивність сільськогосподарського виробництва",
						terms: "виберіть 1 правильну відповідь",
						answer: [
							{
								id: 1,
								answer: "від хімії",
							},
							{
								id: 0,
								answer: "від села",
							},
							{
								id: 0,
								answer: "від фермера",
							},
							{
								id: 0,
								answer: "від президента",
							}
						]
					},
				]
			},
			{
				id: 71,
				title: "Що вивчає хімія?",
				info: `Вивчаючи природознавство, фізику, біологію, ви вже 
				познайомилися з поняттями «фізичне тіло» і «речовина», маєте 
				уявлення про склад фізичних тіл. Наприклад, шматок граніту 
				та зерно – це фізичні тіла. Вони неоднорідні.
				До складу зерна входять крохмаль, білки, рослинні жири. Граніт 
				складається з кварцу, слюди та польового шпату. Білки, рослинні 
				жири, кварц, слюда, польовий шпат, крохмаль – це речовини.

				Речовини це те, з чого складаються фізичні тіла.
				Речов дуже багато, і кожне їх характеризуються певними властивостями.
				Ознаки, якими речовини відрізняються одна від друга чи подібні між собою, називаються властивостями речовин.
				Важливим завданням хімії є вивчення речовин, їх властивостей та прогнозування використання речовин у народному господарстві.`,
				downInfo: ``,
				url: "",
				video: "https://www.youtube.com/embed/EpBWOBo7-UU",
				answers: [
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
						}
					},
					{
						id: 0,
						type: "test",
						question: "Химия изучает ...",
						terms: "выберите 1 правильный ответ",
						answer: [
							{
								id: 1,
								answer: "...химию",
							},
							{
								id: 0,
								answer: "...биологию",
							},
							{
								id: 0,
								answer: "...физику",
							},
							{
								id: 0,
								answer: "...алгебру",
							}
						]
					},
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
							{
								type: "weight",
								what: "соли",
							}
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
						}
					},
				]
			},
			{
				id: 72,
				title: "3 занятие химии",
				info: "22222222222222222222Какая-то краткая информация, Какая-то краткая информация,222222222222222222222222Какая-то краткая информация, Какая-то краткая информация,22222222222222222222222222",
				downInfo: ``,
				url: "",
				video: "https://www.youtube.com/embed/GJN7hE5ijnI",
				answers: [
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
							{
								type: "weight",
								what: "соли",
							}
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
				]
			},
			{
				id: 71,
				title: "Що вивчає хімія?",
				info: `Вивчаючи природознавство, фізику, біологію, ви вже 
				познайомилися з поняттями «фізичне тіло» і «речовина», маєте 
				уявлення про склад фізичних тіл. Наприклад, шматок граніту 
				та зерно – це фізичні тіла. Вони неоднорідні.
				До складу зерна входять крохмаль, білки, рослинні жири. Граніт 
				складається з кварцу, слюди та польового шпату. Білки, рослинні 
				жири, кварц, слюда, польовий шпат, крохмаль – це речовини.

				Речовини це те, з чого складаються фізичні тіла.
				Речов дуже багато, і кожне їх характеризуються певними властивостями.
				Ознаки, якими речовини відрізняються одна від друга чи подібні між собою, називаються властивостями речовин.
				Важливим завданням хімії є вивчення речовин, їх властивостей та прогнозування використання речовин у народному господарстві.`,
				downInfo: ``,
				url: "",
				video: "https://www.youtube.com/embed/EpBWOBo7-UU",
				answers: [
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
						}
					},
					{
						id: 0,
						type: "test",
						question: "Химия изучает ...",
						terms: "выберите 1 правильный ответ",
						answer: [
							{
								id: 1,
								answer: "...химию",
							},
							{
								id: 0,
								answer: "...биологию",
							},
							{
								id: 0,
								answer: "...физику",
							},
							{
								id: 0,
								answer: "...алгебру",
							}
						]
					},
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
							{
								type: "weight",
								what: "соли",
							}
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
						}
					},
				]
			},
			{
				id: 72,
				title: "3 занятие химии",
				info: "22222222222222222222Какая-то краткая информация, Какая-то краткая информация,222222222222222222222222Какая-то краткая информация, Какая-то краткая информация,22222222222222222222222222",
				downInfo: ``,
				url: "",
				video: "https://www.youtube.com/embed/GJN7hE5ijnI",
				answers: [
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
							{
								type: "weight",
								what: "соли",
							}
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
				]
			},
			{
				id: 71,
				title: "Що вивчає хімія?",
				info: `Вивчаючи природознавство, фізику, біологію, ви вже 
				познайомилися з поняттями «фізичне тіло» і «речовина», маєте 
				уявлення про склад фізичних тіл. Наприклад, шматок граніту 
				та зерно – це фізичні тіла. Вони неоднорідні.
				До складу зерна входять крохмаль, білки, рослинні жири. Граніт 
				складається з кварцу, слюди та польового шпату. Білки, рослинні 
				жири, кварц, слюда, польовий шпат, крохмаль – це речовини.

				Речовини це те, з чого складаються фізичні тіла.
				Речов дуже багато, і кожне їх характеризуються певними властивостями.
				Ознаки, якими речовини відрізняються одна від друга чи подібні між собою, називаються властивостями речовин.
				Важливим завданням хімії є вивчення речовин, їх властивостей та прогнозування використання речовин у народному господарстві.`,
				downInfo: ``,
				url: "",
				video: "https://www.youtube.com/embed/EpBWOBo7-UU",
				answers: [
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
						}
					},
					{
						id: 0,
						type: "test",
						question: "Химия изучает ...",
						terms: "выберите 1 правильный ответ",
						answer: [
							{
								id: 1,
								answer: "...химию",
							},
							{
								id: 0,
								answer: "...биологию",
							},
							{
								id: 0,
								answer: "...физику",
							},
							{
								id: 0,
								answer: "...алгебру",
							}
						]
					},
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
							{
								type: "weight",
								what: "соли",
							}
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
					{
						id: 1,
						type: "equations",
						question: "XO2+YH2->ZH2O",
						terms: "Введите правильные числа",
						answer: {
							x: 1,
							y: 2,
							z: 3,
						}
					},
				]
			},
			{
				id: 72,
				title: "3 занятие химии",
				info: "22222222222222222222Какая-то краткая информация, Какая-то краткая информация,222222222222222222222222Какая-то краткая информация, Какая-то краткая информация,22222222222222222222222222",
				downInfo: ``,
				url: "",
				video: "https://www.youtube.com/embed/GJN7hE5ijnI",
				answers: [
					{
						id: 2,
						type: "task",
						question: "В 300грамм воды расстворили 15грамм соли, определите массовую доли растворённого вещества.",
						given: [
							{
								type: "weight",
								what: "H2O",
								howMany: 300,
							},
							{
								type: "weight",
								what: "соли",
								howMany: 15,
							},

						],
						search: [
							{
								type: "percent",
								what: "соли",
							},
							{
								type: "weight",
								what: "соли",
							}
						],
						terms: "Решите задачку",
						answer: 4.76,
					},
				]
			}
		]
	},
]

//Вывод всех курсов по химии
const courseOutput = (course) => {

	const divContainer = document.querySelector(".container__right-container")

	for (let i = 0; i < course.length; i++) {
		//	блок для темы курса
		const courseThemes = document.createElement("div")
		courseThemes.className = "right-container__bottom-themes"




		// круг прогресса
		const circle = document.createElement("div")
		circle.className = "circle-progress"

		const circleInCircle = document.createElement("div")
		circleInCircle.className = "circle-progress-center"
		circleInCircle.innerHTML = `<h1>20%</h1>`

		divContainer.append(courseThemes)
		courseThemes.append(circle)
		circle.append(circleInCircle)

		//центральная инфа
		const centerInfo = document.createElement("div")
		centerInfo.className = "center-info"

		//заглавие
		const title = document.createElement("h2")
		title.innerHTML = course[i].title

		//краткая информация про курс
		const info = document.createElement("p")
		info.innerHTML = course[i].info

		//вывод список тем 
		const paragraph = document.createElement("p")

		courseThemes.append(centerInfo)
		centerInfo.append(title)
		centerInfo.append(info)
		centerInfo.append(paragraph)

		//темы
		const divLessonsThemes = document.createElement("div")
		divLessonsThemes.className = "lessons-themes"
		centerInfo.append(divLessonsThemes)

		//блок для списка
		const olList = document.createElement("details")
		divLessonsThemes.append(olList)

		//цикл для проверки количества тем
		for (let j = 0; j < course[i].themes.length; j++) {

			if (j < 1) {
				const titleListItem = document.createElement("summary")
				titleListItem.innerHTML = "Показати список тем"
				olList.append(titleListItem)
			}
			//отдельная тема блок
			const listItem = document.createElement("p")
			olList.append(listItem)

			//название темы и ссылка
			const listItemLink = document.createElement("a")
			listItemLink.setAttribute("onclick", `createLesson(${i},${j})`)
			listItemLink.innerHTML = `Тема ${j + 1}: ${course[i].themes[j].title}`
			listItem.append(listItemLink)

			//процент пройденный студентом
			const listItemPercent = document.createElement("h4")
			listItemPercent.innerHTML = `0%`
			listItem.append(listItemPercent)

		}

		//кнопка продолжить
		const divButton = document.createElement("div")
		divButton.className = "right-button"
		const button = document.createElement("button")
		button.innerHTML = "<h3>Продовжити</h3>"
		divButton.append(button)
		courseThemes.append(divButton)
	}

}
courseOutput(course);

//удаление блоков с курсами
const courseClose = () => {
	const divСourse = document.querySelectorAll(".right-container__bottom-themes")
	for (let i = 0; i < divСourse.length; i++) {
		if (divСourse) divСourse[i].remove()
	}
}

//функция для крестика закрыть окно урока
const crossClose = () => {
	const divWindow = document.querySelector(".window-leson")
	if (divWindow) divWindow.remove()
	courseClose()
	courseOutput(course)
}

//функция что бы создать окно удалив предыдущее окно если оно есть конечно
const createLesson = (idCourse, idTheme) => {
	courseClose()

	crossClose()

	const body = document.querySelector("body")

	//создаем блок окна
	const window = document.createElement("div")
	window.className = "window-leson"

	//закидываем просто в тело
	body.append(window)

	//верзний блок с видео, заголовком, инфой под заголовок и крестик
	const videoTitle = document.createElement("div")
	videoTitle.className = "video__title"
	window.append(videoTitle)

	//Если есть видос, создаем видео
	if (course[idCourse].themes[idTheme].video) {
		const iframe = document.createElement("iframe")
		iframe.classList = "video"
		iframe.setAttribute("src", course[idCourse].themes[idTheme].video)
		iframe.setAttribute("title", "YouTube video player")
		iframe.setAttribute("frameborder", 0)
		iframe.setAttribute("allow", "accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture")
		iframe.setAttribute("allowfullscreen", '')
		videoTitle.append(iframe)
	}

	//Правая информация блок
	const rightInfo = document.createElement("div")
	rightInfo.className = "right-info"
	videoTitle.append(rightInfo)

	//Заголовок
	const rightInfoTitle = document.createElement("h2")
	rightInfoTitle.innerHTML = `Тема ${idTheme + 1}: ${course[idCourse].themes[idTheme].title}`
	rightInfo.append(rightInfoTitle)

	//информация под заголовком
	const rightInfoInfo = document.createElement("p")
	rightInfoInfo.innerHTML = course[idCourse].themes[idTheme].info
	rightInfo.append(rightInfoInfo)

	//кнопка крестика
	const button = document.createElement("button")
	button.className = "cross"
	button.innerHTML = "<img src=image/cross.png alt=cross>"
	button.setAttribute("onclick", "crossClose()")
	videoTitle.append(button)

	//нижний блок для остальной информации
	//TODO сделать в БД поле для нижней информации
	const bottomInformation = document.createElement("div")
	bottomInformation.className = "bottom-information"
	bottomInformation.innerHTML = course[idCourse].themes[idTheme].downInfo

	window.append(bottomInformation)

	const testTitle = document.createElement("h2")
	testTitle.innerHTML = "Тесты"



	window.append(testTitle)


	tests(idCourse, idTheme)


	goUp()
}


var timeOut;
function goUp() {
	var top = Math.max(document.body.scrollTop, document.documentElement.scrollTop);
	if (top > 0) {
		window.scrollBy(0, -100);
		timeOut = setTimeout('goUp()', 20);
	} else clearTimeout(timeOut);
}

//Удаление блока с тестом
const testClose = () => {
	const divTest = document.querySelector(".form-test")
	if (divTest) divTest.remove()
	courseClose()

}

//генератор тестов
const tests = (idCourse, idTheme) => {
	testClose()

	const window = document.querySelector(".window-leson")

	const testList = document.createElement("form")
	testList.className = "form-test"
	window.append(testList)

	//цикл для вопросов и ответов
	for (let i = 0; i < course[idCourse].themes[idTheme].answers.length; i++) {

		//вопросы
		const testTitle = document.createElement("h2")


		const testTerms = document.createElement("p")
		testTerms.innerHTML = course[idCourse].themes[idTheme].answers[i].terms

		const testQuestion = document.createElement("h3")
		testQuestion.innerHTML = `${course[idCourse].themes[idTheme].answers[i].question}`

		const hr = document.createElement("hr")

		testList.append(testTitle)
		testList.append(testTerms)
		testList.append(testQuestion)

		//цикл для ответов для типа тестов .type === "test"
		if (course[idCourse].themes[idTheme].answers[i].type === "test") {

			for (let j = 0; j < course[idCourse].themes[idTheme].answers[i].answer.length; j++) {

				//Создаем параграф с инпутом для каждого варианта ответа
				const paragraphInput = document.createElement("p")

				const inputAnswer = document.createElement("input")
				inputAnswer.setAttribute("type", "radio")
				inputAnswer.setAttribute("name", `answer${i}`)
				inputAnswer.setAttribute("id", `answer${i}`)
				if (course[idCourse].themes[idTheme].answers[i].answer[j].id === 1) inputAnswer.setAttribute("class", `yes`)
				else inputAnswer.setAttribute("class", `no`)

				paragraphInput.append(inputAnswer)

				//Сам ответ для каждого из инпутов с значением
				const valueInput = document.createElement("label")
				valueInput.setAttribute("for", `answer${i}`)
				valueInput.innerHTML = course[idCourse].themes[idTheme].answers[i].answer[j].answer

				paragraphInput.append(valueInput)
				// загружаем в форму
				testList.append(paragraphInput)
			}
		}
		//цикл для ответов для типа тестов .type === "equations"
		else if (course[idCourse].themes[idTheme].answers[i].type === "equations") {
			let e = 0;
			for (var key in course[idCourse].themes[idTheme].answers[i].answer) {
				const inputEquations = document.createElement("input")
				inputEquations.setAttribute("type", "number")
				inputEquations.setAttribute("class", `equations`)

				const answerEquations = course[idCourse].themes[idTheme].answers[i].answer[key]

				//для проверки в дальнейшем теста я добавил для айдишки 4 пунка, айди курса, айди темы, порядок теста и правильный ответ
				inputEquations.setAttribute("id", `${i}${answerEquations}`)
				inputEquations.setAttribute("placeholder", key)
				inputEquations.setAttribute("min", 1)
				inputEquations.setAttribute("max", 100)
				inputEquations.setAttribute("max", 100)
				testList.append(inputEquations)
				e++;
			}
		}

		//цикл для ответов для типа тестов .type === "task"
		else {
			const inputGiven = document.createElement("h3")
			inputGiven.innerHTML = "Дано:"
			inputGiven.style.marginTop = "20px";
			inputGiven.style.marginBottom = "10px";
			testList.append(inputGiven)

			//цикл для полей что дает задача
			for (let l = 0; l < course[idCourse].themes[idTheme].answers[i].given.length; l++) {
				const given = document.createElement("p")
				//в переменные значения для удобства
				const what = course[idCourse].themes[idTheme].answers[i].given[l].what
				const howMany = course[idCourse].themes[idTheme].answers[i].given[l].howMany
				const type = course[idCourse].themes[idTheme].answers[i].given[l].type

				//проверка на тип или вес, или проценты ну или моль
				if (type === "weight") {
					given.innerHTML = `${what}: ${howMany} г.`
				}
				else if (type === "percent") {
					given.innerHTML = `${what}: ${howMany} %.`
				}
				else {
					given.innerHTML = `${what}: ${howMany} моль`
				}
				testList.append(given)
			}

			const searchTask = document.createElement("h3")
			searchTask.innerHTML = "Знайти:"
			searchTask.style.marginTop = "20px";
			searchTask.style.marginBottom = "10px";

			testList.append(searchTask)

			//цикл для полей что нужно найти
			for (let h = 0; h < course[idCourse].themes[idTheme].answers[i].search.length; h++) {

				search = document.createElement("p")

				const type = course[idCourse].themes[idTheme].answers[i].search[h].type
				const what = course[idCourse].themes[idTheme].answers[i].search[h].what

				const answer = course[idCourse].themes[idTheme].answers[i].answer

				const inputGiven = document.createElement("input")
				inputGiven.setAttribute("type", "number")
				inputGiven.setAttribute("class", `task`)
				inputGiven.setAttribute("id", answer)
				inputGiven.setAttribute("step", `0.01`)

				//проверка на тип или вес, или проценты ну или моль
				if (type === "weight") {
					search.append(`г. ${what} `)
				}
				else if (type === "percent") {
					search.append(`% ${what} `)
				}
				else {
					search.append(`моль ${what} `)
				}
				testList.append(search)
				search.append(inputGiven)

			}
		}
		testList.append(hr)
	}

	//создаем кнопку в конце
	const buttonSend = document.createElement("button")
	buttonSend.className = "button-sumbit"
	buttonSend.innerHTML = "Проверить"
	buttonSend.setAttribute("onclick", `checkResult(${idCourse},${idTheme})`)
	testList.append(buttonSend)
}

//Проверка ответов
function checkResult(idCourse, idTheme) {

	const inputsTests = document.querySelectorAll(".yes")
	const inputsEquations = document.querySelectorAll(".equations")
	const inputsTask = document.querySelectorAll(".task")

	const testLength = inputsTests.length + inputsEquations.length + inputsTask.length;

	let trueAnswers = 0;

	//проверка на правильность тестов
	for (let i = 0; i < inputsTests.length; i++) {
		if (inputsTests[i].checked === false) {
			message(idCourse, idTheme, 0)
			break
		}
		else trueAnswers++
	}
	//проверка на правильность уравнений

	for (let i = 0; i < inputsEquations.length; i++) {
		if (inputsEquations[i].value == inputsEquations[i].id[1]) trueAnswers++
		else {
			message(idCourse, idTheme, 0)
			break
		}
	}
	//проверка на правильность задач
	for (let i = 0; i < inputsTask.length; i++) {
		if (inputsTask[i].value == inputsTask[i].id) trueAnswers++
		else {
			message(idCourse, idTheme, 0)
			break
		}
	}

	if (trueAnswers == testLength) {
		message(idCourse, idTheme, 1)
	}
}

//Отправка сообщения о тестах
const message = (idCourse, idTheme, type) => {
	testClose()

	const window = document.querySelector(".window-leson")

	searchMessage = document.querySelector(".message")

	const buttonCross = document.querySelector(".cross")

	buttonCross.setAttribute("onclick", "")


	if (!searchMessage) {
		const message = document.createElement("h2")
		message.className = "message"
		message.style.marginTop = "30px"



		if (type == 0) {
			message.innerHTML = "У ваших відповідях є помилка, спробуйте ще раз!"
			message.style.color = "#ff0000"
			setTimeout(() => {
				message.remove()
				tests(idCourse, idTheme)
				buttonCross.setAttribute("onclick", "crossClose()")
			}, 4000);
		}
		else {
			message.innerHTML = "Вітаємо! Усі відповіді правильні!"
			message.style.color = "#00aa09"
			buttonCross.setAttribute("onclick", "crossClose()")
		}
		window.append(message)


	}

}